src/InformationRegisters/am_ХранилищеНастроек/am_ХранилищеНастроек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>am_ХранилищеНастроек</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
      <types>CatalogRef.АвтоматическиеСкидки</types>
      <types>CatalogRef.ВидыЦен</types>
      <types>String</types>
      <types>CatalogRef.Номенклатура</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.ХранилищеШаблонов</types>
      <types>CatalogRef.Контрагенты</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СвязиКонтрагентКонтакт/СвязиКонтрагентКонтакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e2861b7a-4d37-4d36-a5b4-2245e8ec61da">
  <name>СвязиКонтрагентКонтакт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="11cd3a37-4efe-485c-8c2e-e30f6f3fefb1">
    <name>СвязьНедействительна</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="e563b4fc-c298-4536-ba17-05e9eec145c6">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9ec600b8-e08b-462b-966e-5a728376cd5a">
    <name>Контакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8d080f3c-06ed-48bf-9709-eea73d676741">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="d4e2da66-9a70-459f-a873-cb4ad71d17b2">
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КонтактныеЛица/КонтактныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9b49c443-8e43-46e8-9f78-e79366f16edc">
  <name>КонтактныеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <tabularSections extendedConfigurationObject="75d42d09-f4ee-4c3d-9d22-ea1d978c4ef2">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ef48f14e-794a-48f7-be9b-6e2a8294fdce">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8c1dd5b0-85ac-4296-8fd1-03be1c91b2c3">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8c082b88-39bb-44a5-99be-05ead63d9144">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d31edcfb-c254-4df6-813c-45d97556c9a4">
  <name>Контрагенты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="05db4b63-1db5-4351-9c2a-a66355361208">
    <name>БанковскийСчетПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="83abc3c8-5d30-4200-9b3c-c098e93d9dd4">
    <name>СтранаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d913c699-9b21-4f70-9e25-e7cd66899b35">
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="98a3a104-c023-42c2-a3c0-d21a8e8f0304">
    <name>КодПоОКПО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7abf59d6-06a4-45fa-b1d0-bf469f93bc01">
    <name>ДатаСоздания</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dcd64d96-d03a-453f-9b38-c9fb1774f698">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4bd3ecda-70e1-4a95-8164-e47939295eac">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="578aaecc-aed2-4ef8-88f9-128a6e803783">
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="adb6110c-e022-4572-88ef-65dd4952fcbe">
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="854ddbe5-0bf2-4200-99b7-e7f1ddfc9a9f">
    <name>КПП</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4c668625-cb13-4bde-bae0-9759ff1df43c">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2371825-a31d-415b-8866-8e1c4f108e47">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5a66e61d-1e1f-42eb-84c7-96c67491221a">
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7257a297-392c-4ed4-93a7-79a4422115a9">
    <name>ИННВведенКорректно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="db9169ee-9f3d-4a47-952e-e3b8415f013a">
    <name>КППВведенКорректно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1fc7846e-c92e-4119-9b0b-ab25f1a6447b">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbfd1e4e-302d-4158-a36e-7de2ee52275f">
    <name>Покупатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="150ea83f-859a-4383-a7e2-add9615c515d">
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5466e60d-3f3b-4854-8bc4-fe713678faf2">
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bffaa0c1-d082-4cef-bb60-629a5f7c83bf">
    <name>ИсточникПривлеченияПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="41b066d1-5b7a-43b3-a41f-e1454f08da07">
    <name>ДокументУдостоверяющийЛичность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0565ba91-4e56-4a4c-9e27-ac8d883651da">
    <name>РегистрационныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="6a614d71-f1bf-4633-927f-fd1ab375a540">
    <name>ВидКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7122d071-c81b-484d-974a-5395bce9e1e5">
    <name>СвидетельствоДатаВыдачи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf75569-7170-46ea-98a4-29bb3969c1c2">
    <name>СвидетельствоСерияНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="94ee9b83-c795-400d-896e-30834d9f55f8">
    <name>ОсновныеСведения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e7689556-bfc3-41aa-a6c2-fae4e917afdd">
    <name>ВестиРасчетыПоДокументам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="76421bdf-3553-4920-b9b2-b9cca25e740f">
    <name>ВестиРасчетыПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="def7c5d9-841f-49c8-a2ab-a11c7b524370">
    <name>НомерТелефонаДляПоиска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>am_НомерКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="89940d0d-bcf8-4eeb-bd2e-6d9d6b5110d0">
    <name>ВалютаРасчетовПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2539e2b6-2cb7-41c5-8e5d-9974cf014a38">
    <name>КодГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ec4ed95c-1f1d-4935-9318-2b9974ec88f0">
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="289fa88c-0c40-46ed-a350-582ad572453e">
    <name>РасчетыВУсловныхЕдиницахПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fd18fe57-8dac-4f41-ba14-ab79115be357">
    <name>ГоловнойКонтрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="659f6c35-8c2c-4875-b5cb-8ac72af650b4">
    <name>ВидГосударственногоОргана</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b164d06e-e560-4c9a-a490-fb1bec54fb76">
    <name>ВестиРасчетыПоДоговорам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd01f401-1241-4c4f-9e6d-5c8ef4ea683c">
    <name>ВестиУчетОплатыПоСчетам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f8460b3-4edc-494c-b668-547bba8b65f1">
    <name>СпособРазнесенияОплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f23efb9-0af4-4fcc-879f-655e4106847d">
    <name>СпособЗачетаПредоплатыПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="80bc655a-d926-42fc-b027-e9e0c125aff4">
    <name>СтатьяДДСПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="7bfdd4f5-ffe7-4ecb-b402-405a8f1c112a">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0256d9ee-2e46-491e-949b-274e47734717">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d0d18a93-e13f-44d2-8da6-7f696fc3a94f">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7a593a7b-ae70-4e71-abe4-e0b7b5559215">
    <name>Теги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ed896ac1-94d1-49ca-a43c-1cb97f99a64a">
      <name>Тег</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/am_МастерКлиентВызовСервера/Module.bsl
Процедура НайтиСоздатьКонтрагентаНаСервисе(ПодстрокаТелефона, ОграничениеПоКоличеству, ПолеПоиска = "phone")
	
	Если НЕ РегистрыСведений.am_ХранилищеНастроек.ПолучитьОбменССТО() Тогда
		Возврат;
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение("31.163.200.98", 20080,,,,, Неопределено, Ложь);
	HTTPЗапрос = Новый HTTPЗапрос("/api/1.0/clients.json?" + ПолеПоиска + "=" + ПодстрокаТелефона + "&limit=" + Формат(ОграничениеПоКоличеству, "ЧГ="));
	Ответ = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку("UTF-8"));
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON);
	
	Если Тип("Структура") = ТипЗнч(ДанныеJSON) Тогда
		СоздатьКонтрагента(ДанныеJSON);
	КонецЕсли;
	
	Если Тип("Массив") = ТипЗнч(ДанныеJSON) Тогда
		Для каждого СтруктураJSON из ДанныеJSON Цикл
			СоздатьКонтрагента(СтруктураJSON);
		КонецЦикла;
	КонецЕсли;
	//Возврат НайтиКонтрагентаПоТелефону(ПодстрокаТелефона);
	
КонецПроцедуры

Процедура СоздатьКонтрагента(СтруктураJSON)
	
	Если НЕ СтруктураJSON.Свойство("uuid") Тогда
		Возврат;
	КонецЕсли;	
	
	Контакт = Справочники.КонтактныеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураJSON.uuid));
	
	Если Контакт.ПолучитьОбъект() = Неопределено Тогда
		КонтактОбъект = Справочники.КонтактныеЛица.СоздатьЭлемент();
		КонтактОбъект.УстановитьСсылкуНового(Контакт);
		КонтактОбъект.Наименование = СтруктураJSON.fio;
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(КонтактОбъект, СтруктураJSON.telephone, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);
		
		Если ЗначениеЗаполнено(СтруктураJSON.email) Тогда
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(КонтактОбъект, СтруктураJSON.email, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);
		КонецЕсли;
		
		КонтактОбъект.Заполнить(Неопределено);
		КонтактОбъект.Записать();
	КонецЕсли;	
	
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураJSON.uuid));
	
	Если Контрагент.ПолучитьОбъект() = Неопределено Тогда
		КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
		КонтрагентОбъект.УстановитьСсылкуНового(Контрагент);
		КонтрагентОбъект.Покупатель = Истина;
		КонтрагентОбъект.Наименование = СтруктураJSON.fio;
		КонтрагентОбъект.Заполнить(Неопределено);
		КонтрагентОбъект.Записать();
		ДобавитьСообщениеПользователю("Создан контрагент " + Строка(СтруктураJSON.fio));
	КонецЕсли;
	
	РегистрыСведений.СвязиКонтрагентКонтакт.НоваяСвязь(Контрагент, Контакт);
	
	Если Тип("Структура") = ТипЗнч(СтруктураJSON.autos) Тогда
		СоздатьАвтобомиль(СтруктураJSON.autos, Контрагент);
	КонецЕСли;
	
	Если Тип("Массив") = ТипЗнч(СтруктураJSON.autos) Тогда
		Для Каждого СтруктураАвто Из СтруктураJSON.autos Цикл
			СоздатьАвтобомиль(СтруктураАвто, Контрагент);
		КонецЦикла;	
	КонецЕСли;
	
КонецПроцедуры

Процедура ДобавитьСообщениеПользователю(Текст)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	
КонецПроцедуры

Процедура СоздатьАвтобомиль(СтруктураJSON, Контрагент)
	
	Автомобиль = Справочники.am_Автомобили.ПолучитьСсылку(Новый УникальныйИдентификатор(СтруктураJSON.uuid));
	
	Если Автомобиль.ПолучитьОбъект() = Неопределено Тогда
		АвтомобильОбъект = Справочники.am_Автомобили.СоздатьЭлемент();
		АвтомобильОбъект.УстановитьСсылкуНового(Автомобиль);
		АвтомобильОбъект.VIN = СтруктураJSON.vin;
		АвтомобильОбъект.ВладелецАвто = Контрагент;
		АвтомобильОбъект.Владелец = Контрагент;
		АвтомобильОбъект.ГосударственныйРегистрационныйЗнак = СтруктураJSON.number;
		АвтомобильОбъект.Модель = ПолучитьМодельАвтомобиля(СтруктураJSON.model, СтруктураJSON.marka);
		АвтомобильОбъект.ОбъёмДвигателя = СтруктураJSON.volume;
		АвтомобильОбъект.Наименование = АвтомобильОбъект.Модель.Наименование + " " + АвтомобильОбъект.ГосударственныйРегистрационныйЗнак;
		АвтомобильОбъект.Записать();
		ДобавитьСообщениеПользователю("Создан автомобиль " + АвтомобильОбъект.Наименование);
	КонецЕсли;
	
	Если Автомобиль.Владелец <> Контрагент Тогда
		АвтомобильОбъект = Автомобиль.ПолучитьОбъект();
		АвтомобильОбъект.Владелец = Контрагент;
		АвтомобильОбъект.Записать();
		ДобавитьСообщениеПользователю("У автомобиля " + АвтомобильОбъект.Наименование + " изменился владелец на " + Строка(Контрагент));
	КонецЕсли;
	
КонецПроцедуры	

Функция ПолучитьМодельАвтомобиля(МодельJSON, МаркаJSON)
	
	Если МодельJSON.Свойство("uuid") Тогда
		Модель = Справочники.am_Модели.ПолучитьСсылку(Новый УникальныйИдентификатор(МодельJSON.uuid));
		Если Модель.ПолучитьОбъект() = Неопределено Тогда
			Марка = Справочники.am_Марки.ПолучитьСсылку(Новый УникальныйИдентификатор(МаркаJSON.uuid));
			Если Марка.ПолучитьОбъект() = Неопределено Тогда
				МаркаОбъект = Справочники.am_Марки.СоздатьЭлемент();
				МаркаОбъект.УстановитьСсылкуНового(Марка);
				МаркаОбъект.Наименование = МаркаJSON.name;
				МаркаОбъект.Записать();
			КонецЕсли;
			МодельОбъект = Справочники.am_Модели.СоздатьЭлемент();
			МодельОбъект.УстановитьСсылкуНового(Модель);
			МодельОбъект.Наименование = МодельJSON.name;
			МодельОбъект.Владелец = Марка;
			МодельОбъект.Записать();
		КонецЕсли;
		Возврат Модель;
	Иначе
		Возврат Справочники.am_Модели.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция НайтиКонтрагентаПоТелефону(ПодстрокаТелефона, ОграничениеПоКоличеству)
	
	ПоисковоеВыражение = СтрЗаменить(ПодстрокаТелефона, "+", "") + "%";
	
	Если СтрНачинаетсяС(ПоисковоеВыражение, "7") Или СтрНачинаетсяС(ПоисковоеВыражение, "8") Тогда
		ПоисковоеВыражение = "[78]" + Сред(ПоисковоеВыражение, 2);
	Иначе
		ПоисковоеВыражение = "%" + ПоисковоеВыражение;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоисковоеВыражение", ПоисковоеВыражение); 
	Запрос.Текст = "ВЫБРАТЬ Первые " + Формат(ОграничениеПоКоличеству, "ЧГ=") + "
	               |	ВложенныйЗапрос.Контрагент КАК Контрагент,
	               |	ВложенныйЗапрос.Телефон КАК Телефон
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КонтрагентыКонтактнаяИнформация.Ссылка КАК Контрагент,
	               |		КонтрагентыКонтактнаяИнформация.НомерТелефона КАК Телефон
	               |	ИЗ
	               |		Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
	               |	ГДЕ
	               |		КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО &ПоисковоеВыражение
	               |		И КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		СвязиКонтрагентКонтактСрезПоследних.Контрагент,
	               |		ВложенныйЗапрос.НомерТелефона
	               |	ИЗ
	               |		РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних КАК СвязиКонтрагентКонтактСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК Контакт,
	               |				КонтактныеЛицаКонтактнаяИнформация.НомерТелефона КАК НомерТелефона
	               |			ИЗ
	               |				Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
	               |			ГДЕ
	               |				КонтактныеЛицаКонтактнаяИнформация.НомерТелефона ПОДОБНО &ПоисковоеВыражение
	               |				И КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)) КАК ВложенныйЗапрос
	               |			ПО СвязиКонтрагентКонтактСрезПоследних.Контакт = ВложенныйЗапрос.Контакт) КАК ВложенныйЗапрос";
	
	Контрагенты = Запрос.Выполнить().Выгрузить();
	
	Если Контрагенты.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Контрагенты;
	КонецЕсли;
	
КонецФункции

Функция НайтиКонтрагентаПоВИН(ПодстрокаПоиска, ОграничениеПоКоличеству)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоисковоеВыражение", "%" + ПодстрокаПоиска + "%");
	//Первые "+Формат(ОграничениеПоКоличеству,"ЧГ=") +" 
	Запрос.Текст = "ВЫБРАТЬ Первые " + Формат(ОграничениеПоКоличеству, "ЧГ=") + " 
	               |	am_Автомобили.Владелец КАК Контрагент,
	               |	am_Автомобили.VIN КАК VIN
	               |ИЗ
	               |	Справочник.am_Автомобили КАК am_Автомобили
	               |ГДЕ
	               |	am_Автомобили.VIN ПОДОБНО &ПоисковоеВыражение";
	
	Контрагенты = Запрос.Выполнить().Выгрузить();
	
	Если Контрагенты.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Контрагенты;
	КонецЕсли;
	
КонецФункции

Функция НайтиКонтрагентаПоГосНомеру(ПодстрокаПоиска, ОграничениеПоКоличеству)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоисковоеВыражение", "%" + ПодстрокаПоиска + "%");
	//Первые "+Формат(ОграничениеПоКоличеству,"ЧГ=") +" 
	
	Запрос.Текст = "ВЫБРАТЬ Первые " + Формат(ОграничениеПоКоличеству, "ЧГ=") + " 
	               |	am_Автомобили.Владелец КАК Контрагент
	               |ИЗ
	               |	Справочник.am_Автомобили КАК am_Автомобили
	               |ГДЕ
	               |	am_Автомобили.ГосударственныйРегистрационныйЗнак ПОДОБНО &ПоисковоеВыражение";
	
	Контрагенты = Запрос.Выполнить().Выгрузить();
	
	Если Контрагенты.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе	
		Возврат Контрагенты;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьКонтрагентаСпискомЗначений(ПодстрокаПоиска, ОграничениеПоКоличеству = 10, ПолеПоиска = "Телефон") Экспорт
	
	Если ПолеПоиска = "Телефон" Тогда
		НайтиСоздатьКонтрагентаНаСервисе(ПодстрокаПоиска, ОграничениеПоКоличеству, "phone");
	ИначеЕсли ПолеПоиска = "ВИН" Тогда
		НайтиСоздатьКонтрагентаНаСервисе(ПодстрокаПоиска, ОграничениеПоКоличеству, "vin");
	ИначеЕсли ПолеПоиска = "ГосНомер" Тогда
		НайтиСоздатьКонтрагентаНаСервисе(ПодстрокаПоиска, ОграничениеПоКоличеству, "number");
	КонецЕсли;
	
	Контрагент = Неопределено;
	
	Если ПолеПоиска = "Телефон" Тогда
		Контрагент = НайтиКонтрагентаПоТелефону(ПодстрокаПоиска, ОграничениеПоКоличеству);
	ИначеЕсли ПолеПоиска = "ВИН" Тогда
		Контрагент = НайтиКонтрагентаПоВИН(ПодстрокаПоиска, ОграничениеПоКоличеству);
	ИначеЕсли ПолеПоиска = "ГосНомер" Тогда
		Контрагент = НайтиКонтрагентаПоГосНомеру(ПодстрокаПоиска, ОграничениеПоКоличеству);
	КонецЕсли;
	
	ДанныеОтвета = Новый СписокЗначений;
	
	Если Контрагент <> Неопределено Тогда
		Для каждого СтрокаКонтрагента из Контрагент Цикл
			ДанныеОтвета.Добавить(СтрокаКонтрагента.Контрагент);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДанныеОтвета;
	
КонецФункции	
	
Функция ПодборАвто(Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	am_Автомобили.Ссылка КАК Автомобиль
	               |ИЗ
	               |	Справочник.am_Автомобили КАК am_Автомобили
	               |ГДЕ
	               |	am_Автомобили.Владелец = &Контрагент
	               |	И НЕ am_Автомобили.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Автомобиль;
	Иначе
		Возврат Справочники.am_Автомобили.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция _ПолучитьСообщенияПользователю(УдалятьСообщения) Экспорт
	
	Возврат ПолучитьСообщенияПользователю(УдалятьСообщения);
	
КонецФункции
